<?php
$servername = "localhost"; 
$username = "root"; 
$password = ""; 
$dbname = "absence_dbp";

$conn = new mysqli($servername, $username, $password, $dbname);
if ($conn->connect_error) { die("Connection failed: " . $conn->connect_error); }
$conn->set_charset("utf8");

$data = json_decode(file_get_contents("php://input"), true);
if (isset($data['students']) && is_array($data['students'])) {
    $students = $data['students'];
    foreach ($students as $student) {
        $class = '';
        if (in_array($student, ['صالح ابوترابی', 'محمد آمارلو', 'محمدپارسا پیرانی', 'امیرصدرا پهلوان', 'ابوالفضل جوریان', 'محمدجواد جوریان', 'امیرشهریار حسینی', 'سید علی‌اصغر حسینی', 'امیررضا خسروی', 'ابوالفضل خواجوئی', 'رامتین رحیمیان نیشابوری', 'سید یونس رضوی', 'محمد‌حسین سعادتی', 'محمدطاها سهیلی راد', 'سینا شاداب‌زاده', 'آبتین شگفته', 'سید مهدیار علم پرور', 'صالح علیشاهی', 'محمدیاسین فرهمندمهر', 'امیرعلی ماروسی', 'امیرعباس محبوبی نیا', 'محمدمعین محمدی', 'آرش معدنچی', 'پارسا نقابی', 'امیرعلی نوکاریزی', 'حسین نیرآبادی', 'امیرعلی نیرآبادی', 'امیر یوسف‌ نژاد محمدیه'])) { 
            $class = '701'; 
        } else if (in_array($student, ['امیرمحمد اسفندی','حسین آهوئی','محمدصالح پیرگزی','سینا جعفری','کسرا جندقی','سید امیررضا حسینی','محمدمتین حکاک','حسام دهنوخلجی','عرفان رزمخواه','سید امیریحیی رضوی','محمدامین زاهدی','محمدحسین سعادتی','یاسین سلطانی','سید روح الاامین سید موسوی','کیان شمس آبادی','داریوش صادقی','حسین ضمیری','محمدمعین عدالتیان طوسی','کوروش غلام پورزو','محمدحسین فتح آبادی','فرهام فولادی','امیرعلی قبیدیان','پارسا گل ماهی','پارسا لکزیان','فرزاد مستعلی','آراد منتظریان','سورنا ولوی','محمدجواد همت آبادی'])) { 
            $class = '702'; 
        } else if (in_array($student, ['حسن اقبالی','امیرمحمد امامی نژاد','امیرعلی امینی','کوروش اندیشمند','امیرعلی باغیشنی','محسن بذرگری','ایلیا تاتاری','راستین تلافیان','امیرعباس توزنده جانی','محمدطاها توزنده جانی','پارسا جعفری','سید محمد حسینی','محمد خادریان','امیرحسین خیرآبادی','علی خیرآبادی','فرزین زارع','امیررضا سعادتی','سروش سوسنی','محمد شامحمدی','علیرضا صادقی','برنا صادقی اول','سجاد طایر','طاها فخریان','پژمان لکزیان','محمد محمدی','داریوش معتمدی','سید حسین میرشجاع عنبرانی','مهرداد نجفی','محمدصدرا نصرآبادی','نیما نصرآبادی','امین نقدبیشی','فرهاد هوایی'])) { 
            $class = '801'; 
        } else if (in_array($student, ['امیرحسین احمدی نیا','امیررضا احمدی نیا','رضا آبکار','علیرضا بوجانی','امیرعلی حسین آبادی','سید ابوالفضل حسینی','سید امیرعلی حسینی راد','سید عماد حسینی فدروی','پارسا خوش لحجه مقدم','کیارش دادپور','امین علی رودی','پرهام زروندی','امیرعلی سعیدی نژاد','امیرحسین سلیمانی','بهنام سلیمانی','پارسا سلیمانی','امیرعلی سوقندی','سید آریا سیدآبادی','محمدشایان شهرآبادی','علی شورورزی','امیرعلی شیرازی','سبحان صدیقی','احمد عمارلو','میثم عین آبادی','محمدمهدی لطفی','محمدصالح مرشدلو','آرمین مسعودی فر','سید مهدی موسوی','مسیح میان بندی','امیرصدرا میرزابیاتی','الیار میرشکاری','حسین نویدمهر'])) { 
            $class = '802'; 
        } else if (in_array($student, ['امیرعباس اسعدی','آرش اکبری','آریان امینیان مقدم','مهرداد بیاتی','محمدرضا بوژمهرانی','ایلیا تاجیک','محمدصدرا حسامی','یاشار حسن زاده','پارسا حسین پور','رضا ده باشیان','صدرا دهنوی','محمد رباطی','سروش سپهری نیا','محمدمهدی سلامی','سید آرتین سیدین','متین صفایی فر','شایان عادلی','علیرضا عارفخانی','سجاد عجمی اول','امیررضا عربخانی','پرهام فولادی ثابت','یاسین قبدیان','علیرضا کرد','سپهر کیوان نژاد','احمدرضا محسن آبادی','حسین مصدق نیشابوری','امیرحسام منظوری'])) { 
            $class = '901'; 
        } else if (in_array($student, ['سروش اعتمادی فرد','امیرعلی امید','امین برزنونی','شایان پیرانی','امیرعلی توحیدی مقدم','سپهر حسنی','سید طاها حسینی','سید یوسف حسینی','احمدرضا حکیمی','امیر سلیمانی','امیرمحمد سیدآبادی','امیرمحمد شورابی','آرشام صالحی','عرفان عربخانی','امیرمهدی غلامی','هومن فخارزاده','محمدمهدی فرجامی تبار','آرمین فرح نیا','سینا فروزش','آرین لطفی','سید صالح موذن تولائی','پارسا ملک زاده','نیما ملک زاده','سید متین موسوی','حسین مولائی شرق','امیرحسین نیک پی','احمدرضا هراتی'])) { 
            $class = '902'; 
        }

        if (!empty($class)) {
            $sql = "INSERT INTO absences (name, time, date, class) VALUES ('$student', CURTIME(), CURDATE(), '$class')";
            if ($conn->query($sql) === TRUE) {
                echo "Record inserted successfully for $student in class $class<br>";
            } else {
                echo "Error inserting $student in class $class: " . $conn->error . "<br>";
            }
        } else {
            echo "No valid class found for $student<br>";
        }
    }
} else if (isset($_GET['show_all'])) {
    function getClassPeriod($time) {
        $time = strtotime($time);
        if ($time >= strtotime("07:00") && $time <= strtotime("09:00")) {
            return "زنگ اول";
        } else if ($time >= strtotime("09:01") && $time <= strtotime("10:40")) {
            return "زنگ دوم";
        } else if ($time >= strtotime("10:41") && $time <= strtotime("12:20")) {
            return "زنگ سوم";
        } else if ($time >= strtotime("12:21") && $time <= strtotime("14:00")) {
            return "زنگ چهارم";
        } else {
            return " خارج از زمان کلاس ها";
        }
    }

    $result = $conn->query("SELECT name, time, class FROM absences ORDER BY time DESC");
    $output = "";
    while ($row = $result->fetch_assoc()) {
        $period = getClassPeriod($row['time']);
        $output .= "<ul><li>" . $row['name'] . " - کلاس " . $row['class'] . " - " . $period . "</li></ul>"; 
    }
    echo $output;
}
$conn->close();
?>
